{"20f23674-f9e8-4cd7-b431-268b202cee89":{"name":"Gochujang Potato Stew","recipeYield":"4 servings","prepTime":"","cookTime":"","totalTime":"1 hour","recipeIngredients":["2 eggs of cats","1 egg"],"recipeInstructions":["Heat a large pot or Dutch oven over medium-high. Melt the butter and add the onion. Season with salt and pepper. Cook, stirring occasionally, until the onion starts to soften, 2 to 3 minutes. Add the garlic and gochujang, and stir until heated through and fragrant, just a few seconds.","Stir in the vegetable broth, soy sauce, honey, potatoes and beans. Season with salt and pepper. Bring to a boil over high, then reduce the heat to medium-low to maintain a gentle boil. Cover and cook for 10 minutes, then add the kale. (It will seem like a lot at first but will wilt down considerably.) Tamping down the kale, continue gently boiling the covered stew, stirring occasionally, until the potatoes are tender and the broth is thickened to your liking, 10 to 20 minutes. Taste the broth and add more salt, pepper and gochujang as desired.","Serve the stew alongside white rice and, for coolness against the heat, top with a dollop of sour cream and a sprinkle of parsley, if using."],"notes":["\n\n                                    "],"url":"https://cooking.nytimes.com/recipes/1024082-gochujang-potato-stew"},"986bbca7-4c99-4b83-8226-8714499006f6":{"name":"Cuban Black Bean Soup","recipeYield":"5 Servings","prepTime":"10 minutes","cookTime":"40 minutes","totalTime":"50 minutes","recipeIngredients":["1 ¼ pounds dried black beans (or 4 cans – 15 oz.), rinsed and drained (see notes)","1 large white onion, chopped","5 garlic cloves, chopped","2 ½ stalks celery, chopped","3 medium carrots, chopped","1 medium red bell pepper, cored and chopped","2 ½ bay leafs","1 ¾ teaspoons cumin","1 ¾ teaspoons smoked paprika","3 ¾ cups water or vegetable broth","juice of one orange + orange halves","himalayan salt and pepper to taste","diced tomatoes","onion","vegan sour cream","lime wedges"],"recipeInstructions":["The night before, rinse beans in colander with cold running water. Pick through and remove any broken or shriveled beans. Place beans in large pot with 5 or 6 cups water and cover to soak overnight.","Next day, drain beans and rinse again. Place beans back in pot, add water, bring to a boil and simmer covered for 1 hour, drain and rinse.","Juice the orange and set the juice aside. Reserve the orange halves for the soup.","To the pot of freshly cooked beans, add the bay leaves, garlic, cumin, paprika, onion, celery, carrots, bell pepper, water/broth, orange halves, salt and pepper, reserving the orange juice for later. Bring to a boil, reduce heat, cover, and simmer for 40 minutes to one hour, or until beans and vegetables are tender, stirring occasionally. Add extra water as necessary (I used another 1 cup of water).","Once beans are tender, remove the orange halves and bay leaves. Use an immersion blender to blend soup to desired consistency. I blended about 3/4, leaving some chunkiness. You could also use a food processor/blender (this method may take two batches to complete). Blending is optional, you may like it chunky as is. Add the orange juice to the pureed soup and cook another 5-10 minutes.","To Serve: Serve alone or over a bed of cooked buckwheat, farro or brown rice. Top soup with a dollop of Sour Cream, Lime Cilantro Cashew ‘Sour Cream’ or Paprika Cashew Crema. You may also like to top it with diced onion, tomatoes, bell peppers, avocado, jalapenos, a squeeze of lime and/or cilantro.","Serves 4 generously, or 6 smaller portions."],"notes":["\n\n                                    "],"url":"https://simple-veganista.com/cuban-black-bean-soup-vegan/#tasty-recipes-8951-jump-target"}}