{"be06be18-6cfc-4b4d-8c03-ef5d29763567":{"name":"Zucchini Bread","recipeYield":"1","prepTime":"10 minutes","cookTime":"55 minutes","totalTime":"3 hours","recipeIngredients":["1 and 3/4 cups (220g) all-purpose flour (spooned &amp; leveled)","1 teaspoon baking powder","1/2 teaspoon baking soda","1/2 teaspoon salt","1 and 1/2 teaspoons ground cinnamon","1/4 teaspoon ground nutmeg","1/2 cup (120ml) vegetable oil (or melted coconut oil)","1/2 cup (100g) packed light or dark brown sugar","1/2 cup (100g) granulated sugar","2 large eggs, at room temperature","1/4 cup (60g) unsweetened applesauce (or sour cream or Greek yogurt)","2 teaspoons pure vanilla extract","1 and 1/2 cups (180g) shredded zucchini (no need to blot)","optional: 1 cup (180g) semi-sweet chocolate chips (or chopped nuts, raisins, etc)"],"recipeInstructions":["Preheat the oven to 350°F (177°C). Grease a 9&#215;5-inch loaf pan. See notes for muffins.","Whisk the flour, baking powder, baking soda, salt, cinnamon, and nutmeg together in a large bowl until thoroughly combined. Set aside. In a medium bowl, whisk the oil, brown sugar, granulated sugar, eggs, applesauce, and vanilla together until combined. Whisk in the zucchini. Pour the wet ingredients into the dry ingredients. Gently stir or whisk until *just* combined; do not overmix. Fold in any optional add-ins like chocolate chips or nuts. Batter is slightly thick.","Spread the batter evenly into prepared loaf pan. Bake for 55-70 minutes. (I like to loosely cover the bread with aluminum foil halfway through to prevent heavy browning on top.) Baking times vary so keep an eye on yours. The bread is done when a toothpick inserted in the center comes out *mostly* clean with zero raw batter. Remove the bread from the oven and set on a wire rack. Cool in pan for 1 hour before removing from pan. You can slice the bread at this point, but it will still be warm in the center and may not slice neatly. For neat slices, continue cooling bread directly on a wire rack and then slice once cooled.","Cover and store leftover bread at room temperature for up to 3-4 days or in the refrigerator for up to 1 week."],"notes":[],"url":"https://sallysbakingaddiction.com/zucchini-bread/"}}