{"be42ba96-b727-4f74-a12e-e5bbc1777351":{"name":"Baked Ziti","image":{"@type":"ImageObject","url":"https://food.fnr.sndimg.com/content/dam/images/food/fullset/2014/7/2/0/WU0701_Baked-Ziti_s4x3.jpg.rend.hgtvcom.406.406.suffix/1404907001836.jpeg","height":"406","width":"406"},"description":"With over 500 five-star reviews, the Pioneer Woman's Baked Ziti recipe is a hearty crowd-pleaser that's so easy to make.","cookTime":"30 minutes","cookTimeOriginalFormat":"P0Y0M0DT0H30M0.000S","totalTime":"1 hour 35 minutes","totalTimeOriginalFormat":"P0Y0M0DT1H35M0.000S","recipeYield":"12 servings","recipeIngredients":["2 tablespoons olive oil","3 cloves garlic, minced","1 large onion, diced","1 pound ground beef","1 pound Italian sausage","Two 14.5-ounce cans tomato sauce or marinara sauce","One 28-ounce can whole tomatoes with juice","2 teaspoons Italian seasoning","1/2 teaspoon red pepper flakes","Salt and freshly ground black pepper","1 pound ziti","1 1/2 pounds mozzarella, grated","One 15-ounce tub whole-milk ricotta","1/2 cup grated Parmesan","2 tablespoons chopped fresh parsley, plus more for sprinkling","2 eggs"],"recipeInstructions":["Heat the olive oil in a pot over medium heat. Add the garlic and onions and saute until starting to soften, 3 to 4 minutes. Add the ground beef and sausage and cook until browned. Drain off almost all of the fat, leaving a bit behind for flavor and moisture. Add the tomato sauce, tomatoes, Italian seasoning, red pepper flakes and some salt and pepper. Stir, bring to a simmer and simmer for 25 to 30 minutes. Remove 3 to 4 cups of the cooked sauce to a bowl to cool down.","Bring a large pot of water to a boil and add some salt. Cook the ziti until not quite al dente.","Preheat the oven to 375 degrees F.","In a bowl, mix 2 cups of the grated mozzarella, the ricotta, Parmesan, parsley, eggs and some salt and pepper. Stir together just a couple of times (do not mix completely).","Drain the pasta and rinse under cool water to stop the cooking and cool it down. Pour it into the bowl with the cheese mixture and toss to slightly combine (there should still be large lumps). Add the cooled reserved meat sauce and toss to combine.","Add half the coated pasta to a large casserole dish or lasagna dish. Spoon half of the remaining sauce over the top, then top with half the remaining mozzarella. Repeat with another layer of the coated pasta and the remaining sauce and mozzarella.","Bake until bubbling, about 20 minutes. Let stand 5 minutes before sprinkling with chopped parsley to serve."],"recipeCategories":["main-dish"],"keywords":["Pasta Recipes","Tomato","Main Dish"],"url":"https://www.foodnetwork.com/recipes/ree-drummond/baked-ziti-2312399"}}