{"8d4b3f18-a95b-4b43-8251-e1fcdd1519fb":{"name":"Banana Nut Breakfast Bars","image":"https://static01.nyt.com/images/2023/01/13/multimedia/SE-banana-nut-breakfast-bars-gwjp/SE-banana-nut-breakfast-bars-gwjp-mediumSquareAt3X.jpg","description":"These bars get their fudgy texture from ripe bananas and are lightly sweetened with honey. They are packed with nut butter, walnuts and oats, making them a satisfying breakfast treat. By combining the mashed bananas with eggs and letting them sit together for 15 minutes, the bananas become extra sweet. That’s because eggs contain a starch-digesting enzyme called amylase, which converts some of the banana starches to sugar. Best of all? The batter comes together quickly, in just one bowl.","totalTime":"1 hour","totalTimeOriginalFormat":"PT1H","recipeYield":"9 bars","recipeIngredients":["2 ripe medium bananas (about 240 grams peeled)","2 large eggs","6 tablespoons/90 milliliters olive oil, plus more for greasing the pan","3/4 cup/187 grams peanut or almond butter","6 tablespoons/120 grams honey","2 teaspoons kosher salt (such as Diamond Crystal), or 1 teaspoon fine salt","2 teaspoons ground cinnamon","2 teaspoons pure vanilla extract","1 cup/100 grams old-fashioned rolled oats","3/4 cup/80 grams walnut halves and pieces, roughly chopped","Flaky salt, for topping"],"recipeInstructions":["In a large bowl, use a fork to mash the bananas; you should get about 1 cup mashed bananas. Add the eggs and whisk with the fork to evenly combine. Set the mixture aside for 15 minutes.","Adjust oven rack to lower-middle position and heat to 350 degrees. Grease an 8- by-8 or 9-by-9-inch baking pan and line it with one long sheet of parchment paper to cover the bottom and two of the sides, creasing as needed to ensure a secure fit.","Add the olive oil, peanut butter, honey, kosher salt, cinnamon and vanilla to the banana mixture and whisk until smooth. Add the oats and whisk to combine.","Scrape the mixture into the prepared pan, then top it with the walnuts and a light sprinkling of flaky salt. Bake until the top feels set when pressed lightly and a toothpick inserted into the center comes out clean, 35 to 40 minutes.","Cool fully before using the parchment to lift the bars out of the pan. Cut into 9 squares and store in an airtight container at room temperature for up to 5 days."],"recipeCategories":["breakfast","easy","snack"],"keywords":["almond butter","banana","bar cookie","make-ahead","one bowl","peanut butter","rolled oat","walnut","gluten-free"],"url":"https://cooking.nytimes.com/recipes/1023798-banana-nut-breakfast-bars?module=Recipe+of+The+Day&pgType=homepage&action=click"}}